app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Roger Ebert"], ["stars", 3], ["comment", "I laughed, I cried, I spilled my popcorn!"], ["movie_id", 1], ["created_at", 2016-10-30 11:17:11 UTC], ["updated_at", 2016-10-30 11:17:11 UTC]]
---
  def create
    @review = @movie.reviews.new(review_params)
    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review = @movie.reviews.find(params[:id])
    @review.destroy